#    -*- mode: org -*-


Archived entries from file /Volumes/Dala/research-dala/npHH/npHH.org


** Neuron current functions

#+BEGIN_SRC python :tangle npHH.py
from neuron_synapse_info import *
#+END_SRC

#+RESULTS:
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
: ImportError: No module named neuron_synapse_info

#+BEGIN_SRC python :tangle npHH.py

# one issue is the use of the if statement - soln try to use classes in cython??
# advantage of using if --- one general function across all neurons -- may be beneficial in parallelizing??

### Calc intrinsic currents 
def neuron_calc(Nrkv, dNrkv, Nov, Iv, neuron_type):
 if neuron_type==Neuron_Types.PY:
  dNrkv[0] = PY.gL * (PY.E_R - Nrkv[0])
# elif neuron_type==1:
 return dNrkv, Nov
#+END_SRC

#+RESULTS:
  
** Main loop
#+BEGIN_SRC python :tangle runHH.py 
T=0
ti=0
Vout=np.zeros(((length_simulation/time_step)))
#initialize_variables
while (ti < length_simulation/time_step):
 for step in range(0,4):
  for si in range(0,np.sum(no_synapses)):
   # dSrkv[Ssi_rk[si]:Ssi_rk[si+1]], Sov[Ssi_ov[si]:Ssi_ov[si+1]] = synapse_calc(Srkv[Ssi_rk[si]:Ssi_rk[si+1]], dSrkv[Ssi_rk[si]:Ssi_rk[si+1]], Sov[Ssi_ov[si]:Ssi_ov[si+1]], Is[si], Sspike[si], Stypes[si])
   Sov[Ssi_ov[si]:Ssi_ov[si+1]] = synapse_calc_ov(Sov[Ssi_ov[si]:Ssi_ov[si+1]], Is[si], Sspike[si], Stypes[si])
  gather_synaptic_currents(Is, Iv, connectivity_matrix)
  for ni in range(0,np.sum(no_neurons)):
   dNrkv[Nsi_rk[ni]:Nsi_rk[ni+1]], Nov[Nsi_ov[ni]:Nsi_ov[ni+1]] = neuron_calc(Nrkv[Nsi_rk[ni]:Nsi_rk[ni+1]], dNrkv[Nsi_rk[ni]:Nsi_rk[ni+1]], Nov[Nsi_ov[ni]:Nsi_ov[ni+1]], Iv[ni], Ntypes[ni])
  rk_steps(Nrkv, dNrkv, Nrk_tmp, T, step) 
 Vout[ti]=Nrkv[0]
 ti=ti+1
 #update_spike_status(Nv,Nspike)
 #distribute_spike_status(Nspike, connectivity, Sspike)

#@tags
# 1: modify when more than 1 synapse type
#+END_SRC

#+RESULTS:
: 
: >>> >>> ... ... ... ... ... ... ... ... ... ... ... ... ... Traceback (most recent call last):
:   File "<stdin>", line 6, in <module>
: NameError: name 'gather_synaptic_currents' is not defined

#+BEGIN_SRC python 
Vout[1:10]
#+END_SRC

#+RESULTS:
: array([-60., -60., -60., -60., -60., -60., -60., -60., -60.])


